# ElementId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FolderItemInfo..::..ElementId Property
FolderItemInfo Class See Also
---
The folder parameter Id
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId ElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ElementId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
```

# See Also
FolderItemInfo Class
Autodesk.Revit.DB Namespace